```cobol
01  WS-DATA-AREA.             
    05  WS-NUMBER PIC 9(5) VALUE 0. 
    05  WS-RESULT PIC 9(7) VALUE 0.
    05 WS-INPUT-DATA PIC X(6).
    05 WS-INPUT-VALID PIC 9 VALUE 0.

PROCEDURE DIVISION.
    PERFORM 100-INPUT-NUMBER
    IF WS-INPUT-VALID = 1 THEN
       COMPUTE WS-RESULT = WS-NUMBER * 2
       DISPLAY "Result: " WS-RESULT
    ELSE
       DISPLAY "Invalid Input"
    END-IF
    STOP RUN.

100-INPUT-NUMBER SECTION.
    DISPLAY "Enter a number (up to 5 digits): "
    ACCEPT WS-INPUT-DATA
    INSPECT WS-INPUT-DATA TALLYING WS-INPUT-VALID FOR LEADING '0'
    IF WS-INPUT-VALID > 0 THEN MOVE WS-INPUT-DATA(2:5) TO WS-NUMBER
       ELSE MOVE WS-INPUT-DATA TO WS-NUMBER
    END-IF
    IF WS-NUMBER > 99999 THEN
        DISPLAY "Number is too large!" 
        STOP RUN
    END-IF
    INSPECT WS-NUMBER TALLYING WS-INPUT-VALID FOR CHARACTERS NOT '0' THROUGH '9'
    IF WS-INPUT-VALID > 0 THEN 
       MOVE 0 TO WS-INPUT-VALID
    END-IF
```